{
  "id": 1,
  "title": "FrameworkPatcher",
  "excerpt": "Tool to modify miui/hyper frameworks",
  "date": "2024-06-01",
  "readTime": "3 min read",
  "content": {
    "introduction": "FrameworkPatcher is an advanced tool designed to help users modify MIUI and Hyper frameworks, specifically for Xiaomi devices running A14 to A15. It simplifies the process of customizing system frameworks, making it accessible even for non-technical users.",
    "sections": [
      {
        "title": "Why FrameworkPatcher?",
        "content": [
          "Customizing system frameworks can be complex and prone to errors. FrameworkPatcher bridges the gap, providing a user-friendly interface and automated scripts to handle critical patching tasks.",
          "Whether you're a developer or an enthusiast, FrameworkPatcher empowers you to take control of your device's framework without the hassle of manual modifications."
        ],
        "list": [
          "Patching framework.jar, services.jar, miui-framework.jar, and miui-services.jar.",
          "Addressing issues like China Notification Fix and signature verification.",
          "Supporting local and remote workflows for flexibility."
        ]
      },
      {
        "title": "Key Features of FrameworkPatcher",
        "content": [
          "FrameworkPatcher offers a range of features that make it an essential tool for anyone looking to customize their Xiaomi device's framework."
        ],
        "list": [
          "China Notification Fix: Resolves notification issues on CN ROMs.",
          "Core Patch: Fully disables signature verification for system apps.",
          "Disable Flag Secure: Allows screenshots in apps that normally block them.",
          "Multi-Floating Window: Increases the limit of floating windows to 50.",
          "Add Gboard: Replaces the default keyboard with Google's Gboard."
        ]
      },
      {
        "title": "How to Use FrameworkPatcher",
        "content": [
          "Using FrameworkPatcher is straightforward, whether you're working locally or remotely. Here's a step-by-step guide to get you started:"
        ],
        "list": [
          "Visit the FrameworkPatcher website and provide the direct URLs of the framework files.",
          "Enter the device name and ROM version correctly.",
          "Click on the Build button and monitor the progress in the workflow.",
          "Once the build is successful, download the patched files from the release section."
        ]
      },
      {
        "title": "Local Patching with FrameworkPatcher",
        "content": [
          "For those who prefer to work locally, FrameworkPatcher provides a `LocalPatch.sh` script that automates the patching process."
        ],
        "list": [
          "Clone the FrameworkPatcher repository to your local machine.",
          "Place the required JAR files (e.g., framework.jar, services.jar) in the directory.",
          "Run the `LocalPatch.sh` script to start the patching process.",
          "The script will handle decompilation, modification, and recompilation of the framework files."
        ]
      },
      {
        "title": "Contributing to FrameworkPatcher",
        "content": [
          "FrameworkPatcher is an open-source project, and contributions are highly encouraged. Here's how you can contribute:"
        ],
        "list": [
          "Fork the project on GitHub.",
          "Create a new branch for your feature or bug fix.",
          "Commit your changes and push them to your branch.",
          "Submit a pull request and wait for the review.",
          "Once approved, your changes will be merged into the main project."
        ]
      }
    ]
  }
}